In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
d = {'Company':['Goog','Goog','MSFT','MSFT','FB','FB'],
    'Person':['SAM','RAM','PAM','DHI','KRI','LIN'],
    'Sales':[200,100,250,400,800,150] }

In [4]:
df= pd.DataFrame(d)

In [5]:
df

  Company Person  Sales
0    Goog    SAM    200
1    Goog    RAM    100
2    MSFT    PAM    250
3    MSFT    DHI    400
4      FB    KRI    800
5      FB    LIN    150

In [6]:
#applying the group by constraint

In [9]:
goupby=df.groupby('Company')

In [10]:
goupby.mean()

         Sales
Company
FB         475
Goog       150
MSFT       325

In [11]:
goupby.sum()

         Sales
Company
FB         950
Goog       300
MSFT       650

In [12]:
goupby.count()

         Person  Sales
Company
FB            2      2
Goog          2      2
MSFT          2      2

In [13]:
goupby.sum().loc['FB']

Sales    950
Name: FB, dtype: int64

In [14]:
#fully qualified notation

In [16]:
df.groupby('Company').sum().loc['FB']

Sales    950
Name: FB, dtype: int64

In [23]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
FB        2.0  475.0  459.619408  150.0  312.5  475.0  637.5  800.0
Goog      2.0  150.0   70.710678  100.0  125.0  150.0  175.0  200.0
MSFT      2.0  325.0  106.066017  250.0  287.5  325.0  362.5  400.0

In [25]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     475.000000
       std      459.619408
       min      150.000000
       25%      312.500000
       50%      475.000000
       75%      637.500000
       max      800.000000
Name: FB, dtype: float64